app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def show
        @event = Event.find_by(id: params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def edit
        @event = Event.find_by(id: params[:id])

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "events" SET "description" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["description", "closing on wing nite!!"], ["updated_at", "2018-10-16 21:06:01.799166"], ["id", 15]]
---
    def update
        @event = Event.find_by(id: params[:id])
        # @event.date = Date.new(params[:event]["date(1i)"].to_i, params[:event]["date(2i)"].to_i, params[:event]["date(3i)"].to_i)
         if @event.update(event_params)

INSERT INTO "events" ("title", "date", "date_object", "start_time", "end_time", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        @event = Event.new(event_params)
        @event.user = current_user
        @event.date = Date.new(params[:event]["date(1i)"].to_i, params[:event]["date(2i)"].to_i, params[:event]["date(3i)"].to_i)
        @event.date_object = @event.date.to_date

        if @event.save

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 9]]
---
    def destroy
        @event = Event.find_by(id: params[:id])
        @event.destroy